TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_КонтрагентыWarehouse/гкс_КонтрагентыWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_КонтрагентыWarehouse</name>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.гкс_ТипыОбъектовWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_КонтрагентыWarehouse/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Находит элемент по внешнему идентификатору или создает новый элемент справочника при необходимости.
//
Функция ЭлементПоВнешнимДанным(ДанныеОтветаВСтруктуре, ТипОбъектаWarehouse) Экспорт
	
	Если ТипЗнч(ДанныеОтветаВСтруктуре) <> Тип("Структура") Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
	ДанныеОтветаВСтруктуре.Вставить("ТипОбъекта", ТипОбъектаWarehouse);
	
	Ссылка = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(
		ДанныеОтветаВСтруктуре[ИмяКлючевогоСвойстваВWarehouse()], 
		"Справочник.гкс_КонтрагентыWarehouse");
		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда	
		// обертка для того чтобы был один алгоритм обработки
		ПолученныеДанные = Новый Массив;
		ПолученныеДанные.Добавить(ДанныеОтветаВСтруктуре);
		гкс_ОбменДаннымиWarehouse.ОбработатьПолученныеДанные(ПолученныеДанные, Ссылка);
		
		Ссылка = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(
			ДанныеОтветаВСтруктуре[ИмяКлючевогоСвойстваВWarehouse()], 
			"Справочник.гкс_КонтрагентыWarehouse");
	КонецЕсли;	
	
	Возврат Ссылка;
			
КонецФункции

#Область КонвертацияПриОбмене

// Возвращает имя ключевого реквизита объекта.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойства() Экспорт
	
	Возврат "ИдентификаторWarehouse";
	
КонецФункции

// Возвращает имя ключевого поля в Warehouse.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойстваВWarehouse() Экспорт
	
	Возврат "id";
	
КонецФункции

// Устанавливает соотвествие имен реквизитов объекта 1с и полей ответа от Warehouse 
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица описания конвертации реквизитов:
// 		* СвойствоКонфигурации - Строка
// 		* СвойствоИсточника - Строка
// 		* ИспользуетсяАлгоритмКонвертации - Число 
// 		* ПравилоКонвертацииСвойства - Строка
// 		* ЭтоТабличнаяЧасть - Булево
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт
	
	ПравилаКонвертации = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, ИмяКлючевогоСвойства(), ИмяКлючевогоСвойстваВWarehouse());
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Наименование",		"name");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаИзменения",		"updatedOn");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ПометкаУдаления", 	"isDeleted");
	
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ТипОбъекта", "ТипОбъекта");
	
	Возврат ПравилаКонвертации;
		
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
